/************************************************
 * P1-1-6.js
 * Created at 2025. 2. 18. 오후 4:27:40.
 *
 * @author tomatosystem
 ************************************************/

/**************************************************
 * 공통 모듈/전역 변수 선언
 **************************************************/
var util = createCommonUtil(); //공통유틸


/**************************************************
 * 사용자 정의 함수
 **************************************************/


/**************************************************
 * 이벤트
 **************************************************/
/*
 * 루트 컨테이너에서 load 이벤트 발생 시 호출.
 * 앱이 최초 구성된후 최초 랜더링 직후에 발생하는 이벤트 입니다.
 */
function onBodyLoad(e){
	
	var initValue = app.getHostProperty("initValue");
	if(initValue && initValue["pdf"]) {
		var blobUrl = initValue["pdf"];
		app.lookup("embpage1").src = blobUrl;
	}
}

